Repository: bynicodevelop/com_nicodevelop_boilerplate
Catalog: lib/l10n/app_*.arb
Languages: fr

# next_label
source: Next
fr: Suivant

# invitation_code_title
source: Invitation Code
fr: Code d'invitation

# sign_up_title
source: Sign Up
fr: S'inscrire

# sign_in_title
source: Sign In
fr: Se connecter

# email_error_text
source: Please enter a valid email address
fr: Merci d'entrer une adresse e-mail valide

# password_label_input
source: Password
fr: Mot de passe

# password_error_text
source: Please enter a password with at least 6 characters
fr: Merci d'entrer un mot de passe avec au moins 6 caractères

# signin_label_button
source: Sign in
fr: Se connecter

# signup_label_button
source: Sign up
fr: S'inscrire

# no_account_label_button
source: No account?
fr: Pas de compte ?

# got_to_signin_label_button
source: Sign in
fr: Se connecter

# affiliate_code_invalid_title
source: Invalid invitation code
fr: Code d'invitation invalide

# affiliate_code_invalid_message
source: The invitation code you entered is invalid.
fr: Le code d'invitation que vous avez entré est invalide.

# affiliate_code_required_field_title
source: Invalid invitation code
fr: Code d'invitation invalide

# affiliate_code_required_field_message
source: Please enter an invitation code to continue.
fr: Merci d'entrer un code d'invitation pour continuer.

# sign_up_email_already_in_use
source: Email already in use
fr: Un compte avec cette adresse e-mail existe déjà.

# sign_up_weak_password
source: Weak password (minimum 6 characters)
fr: Le mot de passe que vous avez entré est trop faible. (6 caractères minimum)

# sign_up_invalid_email
source: Invalid email
fr: Merci d'entrer une adresse e-mail valide

# sign_up_operation_not_allowed
source: Operation not allowed
fr: L'inscription n'est pas autorisée pour le moment. Merci de réessayer plus tard.

# sign_up_failed_create_account
source: Failed to create account
fr: Votre création de compte à échoué.

# sign_in_bad_credentials_title
source: Bad credentials
fr: Mauvais identifiants

# sign_in_bad_credentials_message
source: The email or password you entered is incorrect.
fr: Votre e-mail et mot de passe ne sont pas corrects.

# profile_screen_title
source: Profile
fr: Profil

# profile_screen_save_button
source: Save
fr: Enregistrer

# profile_screen_update_success_title
source: Updated
fr: Profil mis à jour

# profile_screen_update_error_title
source: Error
fr: Erreur

# profile_screen_update_success_description
source: Your profile has been updated.
fr: Votre profil a été mis à jour avec succès.

# profile_screen_update_email_invalid_description
source: The email you entered is invalid.
fr: Merci d'entrer une adresse e-mail valide

# profile_screen_update_email_already_in_user_description
source: The email you entered is already in use.
fr: Un compte avec cette adresse e-mail existe déjà.

# profile_screen_update_operation_not_allowed_description
source: Operation not allowed. Please try again later.
fr: La mise à jour de votre profil n'est pas autorisée pour le moment. Merci de réeessayer plus tard.

# profile_screen_update_weak_password_description
source: Weak password (minimum 6 characters).
fr: Votre mot de passe n'est pas assez complexe (6 caractères minimum)

# profile_screen_network_request_failed_description
source: Network request failed.
fr: Problème de connexion. Merci de réeessayer plus tard.

# common_cancel
source: Cancel
fr: Annuler

# common_confirm
source: Confirm
fr: Confirmer

# delete_account_button_confirm_modal_title
source: Delete account
fr: Suppression de compte

# delete_account_button_confirm_modal_description
source: Are you sure you want to delete your account? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer votre compte. Cette opération est irréversible.

# setting_item_profile_title
source: Profile
fr: Profil

# setting_item_profile_description
source: Edit your profile
fr: Modifier votre profil

# setting_item_about_title
source: About
fr: À propos

# setting_item_about_description
source: About this app
fr: À propos de l'application

# setting_item_logout_title
source: Logout
fr: Déconnexion

# setting_item_logout_description
source: Logout from this app
fr: Déconnexion de l'application

# upload_file_error_title
source: Error
fr: Erreur

# upload_file_error_description
source: Failed to upload file
fr: Une erreur est survenue lors de l'envoi du fichier.
